[
  {
    "title": "Text Utilities",
    "iconName": "TextFields",
    "tools": [
      {
        "name": "Sanitize Text",
        "link": "/sanitize-text",
        "iconName": "MdCleaningServices",
        "isEnabled": true,
        "description": "Removes unwanted characters, formatting, and HTML from text to clean it up."
      },
      {
        "name": "Text Formatter",
        "link": "/format-text",
        "iconName": "CgFormatText",
        "isEnabled": true,
        "description": "Formats text with lowercase, uppercase, reverse, etc."
      }
    ]
  },
  {
    "title": "Calculators",
    "iconName": "FaLock",
    "tools":[
      {
        "name": "Print Cost Estimator",
        "link": "/print-cost-estimator",
        "iconName": "ImPrinter",
        "isEnabled": true,
        "description": "The Print Cost Estimator is a user-friendly tool designed to help individuals and businesses accurately calculate the costs associated with printing documents. Users can input various parameters such as the number of pages, print type (single-sided or double-sided), and print mode (black & white or color) to receive an instant estimate of printing expenses, including breakdowns for ink and paper costs. This estimator is essential for budget planning and cost management, providing transparency and efficiency in print-related expenditures."
    }
    
    ]
  },
  {
    "title": "Encryption & Encoding Utilities",
    "iconName": "FaLock",
    "tools": [
      {
        "name": "Base 64 Encoder/Decoder",
        "link": "/base64-encoder-decoder",
        "iconName": "AiOutlineFieldString",
        "isEnabled": true,
        "description": "Encodes or decodes text into or from Base64 format, commonly used in data transmission."
      },
      {
        "name": "Password Generator",
        "link": "/password-generator",
        "iconName": "FaKey",
        "isEnabled": true,
        "description": "Generate strong, random passwords effortlessly with our Password Generator. Customize your password length and choose from various character types, including numbers, lowercase, uppercase, and symbols. Whether you want to create a secure password for your accounts or generate multiple passwords at once, our intuitive tool ensures your passwords are both complex and easy to remember. Stay protected and enhance your online security with just a few clicks!"
      },
      {
      "name": "JWT Decoder",
      "link": "/jwt-decoder",
      "iconName": "FaKey",
      "isEnabled": true,
      "description": "Decode, inspect, and validate JSON Web Tokens (JWT) just like jwt.io. View header, payload, and signature, check token validity, and see claims in a readable format. Supports secret/key verification and highlights token expiration, issuer, audience, and other claims for easy debugging and analysis."
     },
      {
        "name": "BCrypt Hashing",
        "link": "/bcrypt-hashing",
        "iconName": "FaHashtag",
        "isEnabled": true,
        "description": "Generates secure hashed passwords using the BCrypt hashing algorithm."
      },
      {
        "name": "Image to Base64 String Converter",
        "link": "/image-to-base64",
        "iconName": "FaImage",
        "isEnabled": true,
        "description": "Converts images to Base64 encoded strings for easy embedding and transmission."
      },
      {
        "name": "Base64 to Image Preview Generator",
        "link": "/base64-to-image",
        "iconName": "FaImage",
        "isEnabled": true,
        "description": "Generates a preview of an image from a Base64 encoded string, allowing you to visualize the image directly."
      },
      {
        "name": "URL Encoder/Decoder",
        "link": "/url-encoder-decoder",
        "iconName": "FaLink",
        "isEnabled": true,
        "description": "Encodes or decodes URLs for safe transmission and readability."
      }
    ]
  }
,
{
  "title": "QR Codes",
  "iconName": "FaQrcode",
  "tools": [
    {
      "name": "QR Code Generator",
      "link": "/qr-code-generator",
      "iconName": "FaQrcode",
      "isEnabled": true,
      "description": "Easily generate QR codes for URLs, text, or contact information. This tool allows you to customize the size, color, and error correction level of the generated QR code. Simply input your data, and instantly create a downloadable QR code image for sharing or embedding."
    },
    {
      "name": "UPI QR Code Generator",
      "link": "/upi-code-generator",
      "iconName": "FaRupeeSign",
      "isEnabled": true,
      "description": "Quickly generate QR codes for UPI payments. Enter the UPI address, receiver's name, and optional amount to create a customizable QR code. Adjust the size, color, and error correction level to suit your needs, and easily download or share the generated QR code."
    },
    {
      "name": "WhatsApp QR Code Generator",
      "link": "/whatsapp-qr-code",
      "iconName": "FaWhatsapp",
      "isEnabled": true,
      "description": "Easily generate WhatsApp QR codes to send messages to any number without saving it in your contacts. Just enter the phone number (with country code) and optional message to create a QR code. Customize the size, color, and error correction level, and download or share the generated QR code for quick communication."
    }
    
    
  ]
},
{
  "title": "JSON Utilities",
  "iconName": "FaCode", 
  "tools": [
  
    {
      "name": "JSON Viewer",
      "link": "/json-viewer",
      "iconName": "FaEye",
      "isEnabled": false,
      "description": "View and navigate through JSON data structures in a user-friendly format. This tool allows you to expand and collapse nested objects and arrays for better readability."
    },
    {
      "name": "JSON Diff Checker",
      "link": "/json-diff-checker",
      "iconName": "FaBalanceScale", 
      "isEnabled": false,
      "description": "Compare two JSON files or strings to identify differences and similarities. This tool highlights changes, additions, and deletions in the JSON data."
    },
    {
      "name": "JSON to CSV Converter",
      "link": "/json-to-csv",
      "iconName": "FaFileCsv", 
      "isEnabled": false,
      "description": "Convert JSON data structures into CSV format for easier data manipulation and analysis."
    },
    {
      "name": "CSV to JSON Converter",
      "link": "/csv-to-json",
      "iconName": "FaFileCsv", 
      "isEnabled": false,
      "description": "Convert CSV data into JSON format for better compatibility with web applications and APIs."
    },
    {
      "name": "JSON to XML Converter",
      "link": "/json-to-xml",
      "iconName": "FaFileCode", 
      "isEnabled": false,
      "description": "Convert JSON data structures into XML format for better compatibility with legacy systems."
    },
    {
      "name": "XML to JSON Converter",
      "link": "/xml-to-json",
      "iconName": "FaFileCode", 
      "isEnabled": false,
      "description": "Convert XML data structures into JSON format for easier manipulation and analysis."
    },
    {
      "name": "JSON to YAML Converter",
      "link": "/json-to-yaml",
      "iconName": "FaExchangeAlt", 
      "isEnabled": false,
      "description": "Convert JSON data structures into the equivalent YAML format."
    },
    {
      "name": "YAML to JSON Converter",
      "link": "/yaml-to-json",
      "iconName": "FaExchangeAlt", 
      "isEnabled": false,
      "description": "Convert YAML data structures into the equivalent JSON format."
    }
  ]
}
,
{
  "title": "Multimedia Utilities",
  "iconName": "FaVideo",
  "tools": [
    {
      "name": "Video Converter",
      "link": "/video-converter",
      "iconName": "FaFileVideo",
      "isEnabled": false,
      "description": "Convert videos between different formats (e.g., MP4, AVI, MOV) quickly and efficiently using FFMPEG WASM. Customize resolution, bitrate, and other settings to suit your needs."
    }
  ]

}
]

